-- 1. Создайте двух пользователей которые имеют доступ к базе данных shop. 
-- Первому пользователю shop_read должны быть доступны только запросы на чтение данных, 
-- второму пользователю shop — любые операции в пределах базы данных shop.

-- Создаём пользователей.
CREATE USER shop_read  IDENTIFIED WITH sha256_password BY 'pass';
CREATE USER shop IDENTIFIED WITH sha256_password BY 'pass';

-- Даём права.
GRANT SELECT ON eshop.* TO shop_read;
GRANT ALL ON eshop.* TO shop;

-- Проверка.
-- Заходим под shop_read.
mysql -u shop_read -p
SELECT USER();
/*
+---------------------+
| USER()              |
+---------------------+
| shop_read@localhost |
+---------------------+
1 row in set (0,00 sec)
*/
select * from eshop.users u;
/*
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Геннадий           | 1990-10-05  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  2 | Наталья            | 1984-11-12  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  3 | Александр          | 1985-05-20  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  4 | Сергей             | 1988-02-14  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  5 | Иван               | 1998-01-12  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  6 | Мария              | 1992-08-29  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
+----+--------------------+-------------+---------------------+---------------------+
6 rows in set (0,00 sec)
*/
delete from eshop.users u
where u.id = 6;
-- ERROR 1142 (42000): DELETE command denied to user 'shop_read'@'localhost' for table 'users'

-- Заходим под shop.
mysql -u shop -p
SELECT USER();
/*
+----------------+
| USER()         |
+----------------+
| shop@localhost |
+----------------+
1 row in set (0,00 sec)
*/
select * from eshop.users u;
/*
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Геннадий           | 1990-10-05  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  2 | Наталья            | 1984-11-12  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  3 | Александр          | 1985-05-20  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  4 | Сергей             | 1988-02-14  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  5 | Иван               | 1998-01-12  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  6 | Мария              | 1992-08-29  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
+----+--------------------+-------------+---------------------+---------------------+
6 rows in set (0,00 sec)
*/
delete from eshop.users u
where u.id = 6;
-- Query OK, 1 row affected (0,01 sec)

-- Запись удалена.
select * from eshop.users u;
/*
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Геннадий           | 1990-10-05  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  2 | Наталья            | 1984-11-12  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  3 | Александр          | 1985-05-20  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  4 | Сергей             | 1988-02-14  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
|  5 | Иван               | 1998-01-12  | 2021-06-13 00:44:29 | 2021-06-13 00:44:29 |
+----+--------------------+-------------+---------------------+---------------------+
5 rows in set (0,00 sec)
*/

-- Удаляем пользователей.
DROP USER shop_read;
DROP USER shop;
